LonersNian/STM32Car/CAR/CAR/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2020 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define Servo_Pin GPIO_PIN_5
#define Servo_GPIO_Port GPIOE
#define LED0_Pin GPIO_PIN_9
#define LED0_GPIO_Port GPIOF
#define LED1_Pin GPIO_PIN_10
#define LED1_GPIO_Port GPIOF
#define WH_L11_Pin GPIO_PIN_0
#define WH_L11_GPIO_Port GPIOC
#define WH_L12_Pin GPIO_PIN_1
#define WH_L12_GPIO_Port GPIOC
#define WH_L21_Pin GPIO_PIN_2
#define WH_L21_GPIO_Port GPIOC
#define WH_L22_Pin GPIO_PIN_3
#define WH_L22_GPIO_Port GPIOC
#define TRIG_Pin GPIO_PIN_6
#define TRIG_GPIO_Port GPIOA
#define ECHO_Pin GPIO_PIN_7
#define ECHO_GPIO_Port GPIOA
#define WH_R11_Pin GPIO_PIN_4
#define WH_R11_GPIO_Port GPIOC
#define WH_R12_Pin GPIO_PIN_5
#define WH_R12_GPIO_Port GPIOC
#define R2_Pin GPIO_PIN_6
#define R2_GPIO_Port GPIOC
#define L2_Pin GPIO_PIN_7
#define L2_GPIO_Port GPIOC
#define R1_Pin GPIO_PIN_8
#define R1_GPIO_Port GPIOC
#define L1_Pin GPIO_PIN_9
#define L1_GPIO_Port GPIOC
#define WH_R21_Pin GPIO_PIN_6
#define WH_R21_GPIO_Port GPIOD
#define WH_R22_Pin GPIO_PIN_7
#define WH_R22_GPIO_Port GPIOD
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
